I've got the same issue. Monitoring was installed via the GUI, I'm now working to set it up on other clusters via Terraform and have imported the existing install.

```shell
#terraform/rancher_cluster$> terraform import rancher2_app_v2.rancher_monitoring $CLUSTER_ID.rancher-monitoring
rancher2_app_v2.rancher_monitoring: Importing from ID "$CLUSTER_ID.rancher-monitoring"...
rancher2_app_v2.rancher_monitoring: Import prepared!
  Prepared rancher2_app_v2 for import
rancher2_app_v2.rancher_monitoring: Refreshing state... [id=$CLUSTER_ID.rancher-monitoring]

Import successful!

The resources that were imported are shown above. These resources are now in
your Terraform state and will henceforth be managed by Terraform.

#terraform/rancher_cluster$> terraform plan
... Refresh output removed ...

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # rancher2_app_v2.rancher_monitoring must be replaced
-/+ resource "rancher2_app_v2" "rancher_monitoring" {
      ~ annotations                 = {} -> (known after apply)
      + chart_name                  = "rancher-monitoring"
      + chart_version               = (known after apply)
      + cleanup_on_fail             = false
      ~ cluster_name                = "$CLUSTER_NAME" -> (known after apply)
      + disable_hooks               = false
      + disable_open_api_validation = false
      + force_upgrade               = false
      ~ id                          = "$CLUSTER_ID.rancher-monitoring" -> (known after apply)
      ~ labels                      = {} -> (known after apply)
      + name                        = "rancher-monitoring" # forces replacement
      + namespace                   = "cattle-monitoring-system" # forces replacement
      + repo_name                   = "rancher-charts"
      + system_default_registry     = (known after apply)
      + wait                        = true
        # (1 unchanged attribute hidden)

      - timeouts {}
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

In my case, I haven't done any significant config as yet so replacing the install isn't a huge issue but I can see situations where this might be a problem.

It also appears that attempts replace the resource may fail:
```shell
#terraform/rancher_cluster$> terraform apply
 ... Refresh output removed ...

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # rancher2_app_v2.rancher_monitoring must be replaced
-/+ resource "rancher2_app_v2" "rancher_monitoring" {
      ~ annotations                 = {} -> (known after apply)
      + chart_name                  = "rancher-monitoring"
      + chart_version               = (known after apply)
      + cleanup_on_fail             = false
      ~ cluster_name                = "$CLUSTER_NAME" -> (known after apply)
      + disable_hooks               = false
      + disable_open_api_validation = false
      + force_upgrade               = false
      ~ id                          = "$CLUSTER_ID.rancher-monitoring" -> (known after apply)
      ~ labels                      = {} -> (known after apply)
      + name                        = "rancher-monitoring" # forces replacement
      + namespace                   = "cattle-monitoring-system" # forces replacement
      + repo_name                   = "rancher-charts"
      + system_default_registry     = (known after apply)
      + wait                        = true
        # (1 unchanged attribute hidden)

      - timeouts {}
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

rancher2_app_v2.rancher_monitoring: Destroying... [id=$CLUSTER_ID.rancher-monitoring]
╷
│ Error: Error removing App V2 : action [uninstall] not available on [&{ collection map[self:https://rancher.$DOMAIN_NAME/k8s/clusters/$CLUSTER_ID/v1/catalog.cattle.io.apps/rancher-monitoring] map[]}]

```

My actual app config is minimal:
```hcl
resource "rancher2_app_v2" "rancher_monitoring" {
  chart_name = "rancher-monitoring"
  cluster_id = rancher2_cluster.main.id
  name       = "rancher-monitoring"
  namespace  = "cattle-monitoring-system"
  repo_name  = "rancher-charts"
}
```